package com.telran.base.lesson2;

public class TypeExample {
    //между сигнатурой класса и кодом, всегда есть отступ в одну строку
    public static void main(String[] args) {
        //две группы типов данных
        //1)примитивные типы
        //2)ссылочне типы (сложные)

        //примитивные типы это: boolean(true, false), char (тиа данных который содержит буквы),
        // byte(диапазон чисел), short, int, long, float, double
        //int - тип данных по умолчанию для целого числа
        //double - тип данных по умолчанию для дробных чисел

        //ссылочные типы это: String, Array(массивы), (любые нащи классы на основании которых
        // мы будем создавать объекты)
        //практически все ссылочные типы состоят из набора примитивных типов

        //переменная - это контейнер для хранения значений
        //у любой переменной есть тип (типы данных, которые будут там хранится), имя переменной, само
        //значение
        int number = 5; //создание переменной целого типа и присвоение ей значения 5

        double doubleNumder;
        doubleNumder = 5.5;

        number = 10;

        }
    }

